1. All the companies that it's name match 'Babelgum'. Retrieve only their name field.
2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by number of employees.
3. All the companies founded between 2000 and 2005, both years included. Retrieve only the name and founded_yearfileds.
4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the name and ipo fields.
5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.
6. All the companies that don't include the partners field.
7. All the companies that have a null type of value on the category_code field.
8. All the companies that have at least 100 employees but less than 1000. Retrieve only the name and number of employees fields.
9. Order all the companies by their IPO price descendently.
10. Retrieve the 10 companies with more employees, order by the number of employees
11. All the companies founded on the second semester of the year. Limit your search to 1000 companies.
12. All the companies that have been 'deadpooled' after the third year.
13. All the companies founded before 2000 that have and acquisition amount of more than 10.000.000
14. All the companies that have been acquired after 2015, order by the acquisition amount, and retrieve only their nameand acquisiton field.
15. Order the companies by their founded year, retrieving only their name and founded year.
16. All the companies that have been founded on the first seven days of the month, including the seventh. Sort them by their aquisition price descendently. Limit the search to 10 documents.
17. All the companies on the 'web' category that have more than 4000 employees. Sort them by the amount of employees in ascendant order.
18. All the companies which their acquisition amount is more than 10.000.000, and currency are 'EUR'.
19. All the companies that have been acquired on the first trimester of the year. Limit the search to 10 companies, and retrieve only their name and acquisition fields.
20. All the companies that have been founded between 2000 and 2010, but have not been acquired before 2011.

In [78]:
# Instalo el modulo
import pandas as pd
import pymongo
from pymongo import MongoClient
from pprint import pprint

In [79]:
client = MongoClient('localhost',27017)
db = client.local
collection = db.mybbd

In [80]:
print(collection.count_documents({}))

18801

1.All the companies that it's name match 'Babelgum'. Retrieve only their name field.

In [45]:
qry1 = collection.find({'name':{'$eq':'Babelgum'}},projection={'name':1,'_id':0})
qry1[0]['name']

'Babelgum'

2.All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by number of employees.

In [110]:
qry2=collection.find( {'number_of_employees':{'$gte':5000}},limit=20,projection={'number_of_employees':1,'_id':0, 'name':1}).sort('number_of_employees',-1)
qry2=pd.DataFrame(list(qry2))
display(qry2.head())

                                         name  number_of_employees
0                                     Siemens               405000
1                                         IBM               388000
2                                      Toyota               320000
3                                      PayPal               300000
4  Nippon Telegraph and Telephone Corporation               227000

All the companies founded between 2000 and 2005, both years included. Retrieve only the name and founded_yearfileds

In [115]:
qry3=collection.find({'founded_year':{'$gte':2000,'$lte':2005}},projection={'name':1,'founded_year':1,'_id':0})
qry3=pd.DataFrame(list(qry3))
display(qry3.head())

   founded_year       name
0          2005   Wetpaint
1          2004       Digg
2          2005       Zoho
3          2005  Omnidrive
4          2003     Gizmoz

All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the name and ipo fields.

In [134]:
qry4=collection.find({'$and': [{'ipo.valuation_amount':{'$gte':100000000}}, {'founded_year':{'$lte':2010}}]},projection={'name':1,'founded_year':1,'ipo.valuation_amount':1,'_id':0})
qry4=pd.DataFrame(list(qry4))
qry4.head()

   founded_year                                 ipo        name
0          2006   {'valuation_amount': 18100000000}     Twitter
1          2004  {'valuation_amount': 104000000000}    Facebook
2          2004    {'valuation_amount': 1300000000}        Yelp
3          2003    {'valuation_amount': 9310000000}    LinkedIn
4          2004     {'valuation_amount': 290000000}  Brightcove

All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.

In [139]:
qry5=collection.find({'$and': [{'founded_year':{'$lte':2005}}, {'number_of_employees':{'$lte':1000}}]},projection={'name':1,'founded_year':1,'number_of_employees':1,'_id':0})
qry5=pd.DataFrame(list(qry5))
qry5.head()

   founded_year                   name  number_of_employees
0          2005               Wetpaint                   47
1          2004                   Digg                   60
2          1996              AdventNet                  600
3          1979  Fox Interactive Media                    0
4          2002                  Plaxo                   50

All the companies that don't include the partners field.

All the companies that have at least 100 employees but less than 1000. Retrieve only the name and number of employees fields.

In [144]:
qry8=collection.find({'$and': [{'number_of_employees':{'$gte':100}}, {'number_of_employees':{'$lte':1000}}]},projection={'name':1,'number_of_employees':1,'_id':0})
qry8=pd.DataFrame(list(qry8))
qry8.head()

        name  number_of_employees
0  AdventNet                  600
1    AddThis                  120
2      OpenX                  305
3   LifeLock                  644
4      Jajah                  110